

#ifndef __RRMRCMINTERFACE_H__
#define __RRMRCMINTERFACE_H__


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "PsTypeDef.h"
#include  "vos_Id.h"



#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


enum RRM_RCM_MSG_TYPE_ENUM
{
    ID_RRM_RCM_PROTECT_RF_IND           = 0x0001,       /* _H2ASN_MsgChoice RRM_RCM_PROTECT_RF_IND_STRU */

    ID_RRM_RCM_DEPROTECT_RF_IND         = 0x0002,       /* _H2ASN_MsgChoice RRM_RCM_DEPROTECT_RF_IND_STRU */

    ID_RRM_RCM_MSG_TYPE_BUTT
};
typedef VOS_UINT32 RRM_RCM_MSG_TYPE_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


typedef struct
{
    VOS_MSG_HEADER                                                              /* _H2ASN_Skip */
    RRM_RCM_MSG_TYPE_ENUM_UINT32                enMsgId;                        /* 消息类型 */  /* _H2ASN_Skip */
    MODEM_ID_ENUM_UINT16                        enModemId;                      /* _H2ASN_Replace VOS_UINT16 enModemId; */
    VOS_UINT8                                   aucReserved[2];
} RRM_RCM_PROTECT_RF_IND_STRU;
typedef struct
{

    VOS_MSG_HEADER                                                              /* _H2ASN_Skip */
    RRM_RCM_MSG_TYPE_ENUM_UINT32                enMsgId;                        /* 消息类型 */  /* _H2ASN_Skip */
    MODEM_ID_ENUM_UINT16                        enModemId;                      /* _H2ASN_Replace VOS_UINT16 enModemId; */
    VOS_UINT8                                   aucReserved[2];
} RRM_RCM_DEPROTECT_RF_IND_STRU;


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/

/*****************************************************************************
  H2ASN顶级消息结构定义
*****************************************************************************/

/*****************************************************************************
 结构名    : RRM_RCM_MSG_DATA
 协议表格  :
 ASN.1描述 :
 结构说明  : RRM_RCM_MSG_DATA数据结构，用于生成ASN文件
*****************************************************************************/
typedef struct
{
    RRM_RCM_MSG_TYPE_ENUM_UINT32        enMsgId;    /*_H2ASN_MsgChoice_Export RRM_RCM_MSG_TYPE_ENUM_UINT32 */
    VOS_UINT8                           aucMsg[4];
    /***************************************************************************
        _H2ASN_MsgChoice_When_Comment          RRM_RCM_MSG_TYPE_ENUM_UINT32
    ****************************************************************************/
}RRM_RCM_MSG_DATA;

/*_H2ASN_Length UINT32*/

/*****************************************************************************
 结构名    : RrmRcmInterface_MSG
 协议表格  :
 ASN.1描述 :
 结构说明  : RrmRcmInterface_MSG数据结构,用于生成ASN文件
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    RRM_RCM_MSG_DATA                             stMsgData;
}RrmRcmInterface_MSG;


/*****************************************************************************
  10 函数声明
*****************************************************************************/





#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of RrmRcmInterface.h */

